'use strict';


////1 Даны два массива: [1, 2, 3] и [4, 5, 6]. Объедините их вместе.

// const a = [1, 2, 3];
// const b = [4, 5, 6];
// const c = a.concat(b);
//
// console.log(c);

////2 Дан массив [1, 2, 3]. Сделайте из него массив [3, 2, 1].

// const a = [1, 2, 3];
// a.reverse(a);
// console.log(a);

////3  Дан массив [1, 2, 3]. Добавьте ему в конец элементы 4, 5, 6.

// const a = [1, 2, 3];
// a.push(4,5,6);
// console.log(a);

////4  Дан массив [1, 2, 3]. Добавьте ему в начало элементы 4, 5, 6.

// const a = [1, 2, 3];
// a.unshift(4,5,6);
// console.log(a);
//


////5  Дан массив ['js', 'css', 'jq']. Выведите на экран первый элемент.

// const a = ['js', 'css', 'jq'];
// console.log(a.shift());

////6  Дан массив ['js', 'css', 'jq']. Выведите на экран последний элемент.

// const a = ['js', 'css', 'jq'];
// console.log(a.pop());

////7 Дан массив [1, 2, 3, 4, 5]. С помощью метода запишите в новый массив элементы [1, 2, 3].

// const a = [1, 2, 3, 4, 5];
// const b = a.slice(0,3);
// console.log(b);

// //8 Дан массив [1, 2, 3, 4, 5]. С помощью метода запишите в новый массив элементы [4, 5].
//
// const a = [1, 2, 3, 4, 5];
// const b = a.slice(3);
// console.log(b);

// //9 Дан массив [1, 2, 3, 4, 5]. С помощью метода преобразуйте массив в [1, 4, 5].

// const a = [1, 2, 3, 4, 5];
// a.splice(1,2);
// console.log(a);


// //10  Дан массив [1, 2, 3, 4, 5]. С помощью метода запишите в новый массив элементы [2, 3, 4].

// const a = [1, 2, 3, 4, 5];
// const b = a.slice(1,4);
// console.log(b);


///11  Дан массив [1, 2, 3, 4, 5]. С помощью метода сделайте из него массив [1, 2, 3, 'a', 'b', 'c', 4, 5].
// const a = [1, 2, 3, 4, 5];
// const b = a.slice(0,3);
//
// b.push('a','b','c',4,5);
// console.log(b);


///12  Дан массив [1, 2, 3, 4, 5]. С помощью метода сделайте из него массив [1, 'a', 'b', 2, 3, 4, 'c', 5, 'e'].

// const a = [1, 2, 3, 4, 5];
// a.splice(1, 4, 'a', 'b', 2, 3, 4, 'c', 5, 'e');
// console.log(a);

////13 Дан массив [3, 4, 1, 2, 7]. Отсортируйте его.

// const a = [3, 4, 1, 2, 7];
// a.sort()
// console.log(a);


// ///14  Дан массив с числами [5, 6, 7, 8, 9]. Найдите сумму этих чисел.
//
// const a = [5, 6, 7, 8, 9];
// const sum = a.reduce((previousValue, currentValue) => previousValue + currentValue, 0);
// console.log(sum);


////15 Дан массив с числами [5, 6, 7, 8, 9]. Сделайте из него массив, состоящий из квадратов этих чисел.

// const a = [5, 6, 7, 8, 9];
// let b = [];
//
// for (let i = 0; i<a.length; i++){
//     b.push(Math.pow(a[i],2));
// }
// console.log(b);

////16  Дан массив с числами [1,-3, 5, 6,-7, 8, 9,-11]. Оставьте в нем только отрицательные числа.

// const a = [1,-3, 5, 6,-7, 8, 9,-11];
// let b = [];
//
// for (let i = 0; i<a.length; i++){
//   (a[i] < 0) ?   b.push(a[i]) : '';
// }
// console.log(b);

///17 Дан массив с числами [1,-3, 5, 6,-7, 8, 9,-11]. Оставьте в нем только четные числа.

// const a = [1,-3, 5, 6,-7, 8, 9,-11];
// let b = [];
//
// for (let i = 0; i<a.length; i++){
//   (a[i] > 0) ?   b.push(a[i]) : '';
// }
// console.log(b);

///18 Дан массив со строками ['aaa', 'aaaqqq', 'zzzqq', 'zz', 'qsaa', 'q', 'az'].
// Оставьте в нем только те строки, длина которых больше 5-ти символов.

// const a = ['aaa', 'aaaqqq', 'zzzqq', 'zz', 'qsaa', 'q', 'az'];
// let b = [];
//
// for (let i = 0; i<a.length; i++){
//   (a[i].length > 5) ?   b.push(a[i]) : '';
// }
// console.log(b);

////19 Дан массив, в нем могут быть обычные элементы и подмассивы,
// например [1, 2, [3, 4], 5, [6, 7]]. Оставьте в нем только подмассивы.


// const a = [1, 2, [3, 4], 5, [6, 7]];
// a.splice(0, 5, [3, 4],[6, 7]);
// console.log(a);



///20. Дан массив с числами [5,-3, 6,-5, 0,-7, 8, 9].
// Посчитайте количество отрицательных чисел в этом массиве.

// const a = [5,-3, 6,-5, 0,-7, 8, 9];
// let b = [];
//
// for (let i = 0; i<a.length; i++){
//   (a[i] < 0) ?   b.push(a[i]) : '';
// }
// console.log(b);
// console.log(b.length);